<template>
    <div id="footer">
<!--        <img :src="footContact">-->
        <div class="footer-image"></div>
        <div class="footer-container">
            <div id="bottom-links">
                <ul class="links-cat">
                    <li>
                        <div class="links-cat-title" @click="showTabContent('1-1')">新手帮助</div>
                        <ul class="links-list">
                            <li @click="showTabContent('1-1')">新手帮助</li>
                            <li @click="showTabContent('1-2')">注册协议</li>
                        </ul>
                    </li>
                    <li>
                        <div class="links-cat-title" @click="showTabContent('2-1')">购物指南</div>
                        <ul class="links-list">
                            <li @click="showTabContent('2-1')">购物流程</li>
                        </ul>
                    </li>
                    <li>
                        <div class="links-cat-title" @click="showTabContent('3-1')">联系我们</div>
                        <ul class="links-list">
                            <li @click="showTabContent('3-1')">联系我们</li>
                            <li @click="showTabContent('3-2')">常见问题</li>
                        </ul>
                    </li>
                    <li>
                        <div class="links-cat-title" @click="showTabContent('4-1')">配送方式</div>
                        <ul class="links-list">
                            <li @click="showTabContent('4-1')">快递送货</li>
                        </ul>
                    </li>
                    <li>
                        <div class="links-cat-title" @click="showTabContent('5-1')">售后服务</div>
                        <ul class="links-list">
                            <li @click="showTabContent('5-1')">退换货流程</li>
                            <li @click="showTabContent('5-2')">发票开具</li>
                            <li @click="showTabContent('5-3')">品质保障</li>
                        </ul>
                    </li>
                    <li>
                        <div class="links-cat-title" @click="showTabContent('6-1')">关于我们</div>
                        <ul class="links-list">
                            <li @click="showTabContent('6-1')">公司介绍</li>
                        </ul>
                    </li>
                </ul>
            </div>
            <slot></slot>
        </div>



        <el-dialog :visible.sync="dialogVisible" >
            <el-tabs tab-position="left" v-model="activeTab" style="height: 500px;" class="footer-tab-pane">
                <el-tab-pane label="新手帮助" name="1-1" class="unit-tab-pane">
                    <h4>
                        1、登陆
                    </h4>
                    <p>可以点击顶上角的登陆链接，转到登陆页面。如果没有账号则需要注册。</p>

                    <p>2、用户可根据注册页面需求的信息填写进行注册。</p>
                    <p>3、如果您忘记了密码，则可以通过登陆页面的 “密码找回？”功能，找回密码。系统会发送密码找回的邮件到您的邮箱。</p>

                    <h4>
                        4、查找商品
                    </h4>
                     <p>直接点击导航栏来选择您想要购买的商品类目。</p>
                    <p>5、购物车操作。您可以在提交订单前对购物车中的商品进行任何的增减操作，或者删除某个商品。确认无误后点击提交订单按钮。</p>
                    <p>6、确认订单页面，选择配送方式后点击提交订单则系统会跳转到支付界面。同时在此页面也能输入您的附加要求，卖家在处理您的订单时候会和您进行确认。</p>
                    <p>7、订单提交后，会进入审核期，审核通过后短信通知收货人。</p>
                </el-tab-pane>
                <el-tab-pane label="注册协议" name="1-2">
                    <div class="text-modify">
                        <p>
                            尊敬的用户欢迎您注册成为本网站会员。请用户仔细阅读以下全部内容。如用户不同意本服务条款任意内容，请不要注册或使用本网站服务。如用户通过本网站注册程序，即表示用户与本网站已达成协议，自愿接受本服务条款的所有内容。此后，用户不得以未阅读本服务条款内容作任何形式的抗辩。
                        </p>
                        <h4>
                            一、本站服务条款的确认和接纳
                        </h4>
                        <p>
                            本网站涉及的各项服务的所有权和运作权归本网站所有。本网站所提供的服务必须按照其发布的服务条款和操作规则严格执行。本服务条款的效力范围及于本网站的一切产品和服务，用户在享受本网站的任何服务时，应当受本服务条款的约束。
                        </p>
                        <h4>
                            二、服务简介

                        </h4>
                        <p>
                            本网站运用自己的操作系统通过国际互联网络为用户提供各项服务。用户必须: 1. 提供设备，如个人电脑、手机或其他上网设备。 2. 个人上网和支付与此服务有关的费用。
                        </p>
                        <h4>
                            三、用户在不得在本网站上发布下列违法信息

                        </h4>
                        <p>
                            1. 反对宪法所确定的基本原则的； 2. 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的； 3. 损害国家荣誉和利益的； 4. 煽动民族仇恨、民族歧视，破坏民族团结的； 5. 破坏国家宗教政策，宣扬邪教和封建迷信的； 6. 散布谣言，扰乱社会秩序，破坏社会稳定的； 7. 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的； 8. 侮辱或者诽谤他人，侵害他人合法权益的； 9. 含有法律、行政法规禁止的其他内容的。

                        </p>
                        <h4>
                            四、有关个人资料

                        </h4>
                        <p>
                            用户同意: 1. 提供及时、详尽及准确的个人资料。 2. 同意接收来自本网站的信息。 3. 不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。 4. 本网站不公开用户的姓名、地址、电子邮箱和笔名。除以下情况外: a) 用户授权本站透露这些信息。 b) 相应的法律及程序要求本站提供用户的个人资料。
                        </p>
                        <h4>
                            五、服务条款的修改
                        </h4>
                        <p>
                            本网站有权在必要时修改服务条款，一旦条款及服务内容产生变动，本网站将会在重要页面上提示修改内容。如果不同意所改动的内容，用户可以主动取消获得的本网站信息服务。如果用户继续享用本网站信息服务，则视为接受服务条款的变动。
                        </p>
                        <h4>
                            六、用户隐私制度
                        </h4>
                        <p>
                            尊重用户个人隐私是本网站的一项基本政策。所以，本网站一定不会在未经合法用户授权时公开、编辑或透露其注册资料及保存在本网站中的非公开内容，除非有法律许可要求或本网站在诚信的基础上认为透露这些信息在以下四种情况是必要的: 1. 遵守有关法律规定，遵从本网站合法服务程序。 2. 保持维护本网站的商标所有权。 3. 在紧急情况下竭力维护用户个人和社会大众的隐私安全。 4. 符合其他相关的要求。
                        </p>
                        <h4>
                            七、用户的帐号、密码和安全性
                        </h4>
                        <p>
                            用户一旦注册成功，将获得一个密码和用户名。用户需谨慎合理的保存、使用用户名和密码。如果你不保管好自己的帐号和密码安全，将负全部责任。另外，每个用户都要对其帐户中的所有活动和事件负全责。你可随时根据指示改变你的密码。用户若发现任何非法使用用户帐号或存在安全漏洞的情况，请立即通告本网站。 八、 拒绝提供担保 用户明确同意信息服务的使用由用户个人承担风险。本网站不担保服务不会受中断，对服务的及时性，安全性，出错发生都不作担保，但会在能力范围内，避免出错。 九、有限责任
                            如因不可抗力或其它本站无法控制的原因使本站销售系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等本站会尽可能合理地协助处理善后事宜，并努力使客户免受经济损失，同时会尽量避免这种损害的发生。
                        </p>
                        <h4>
                            十、用户信息的储存和限制

                        </h4>
                        <p>
                            本站有判定用户的行为是否符合国家法律法规规定及本站服务条款权利，如果用户违背本网站服务条款的规定，本网站有权中断对其提供服务的权利。

                        </p>
                        <h4>
                            十一、用户管理

                        </h4>
                        <p>
                            用户单独承担发布内容的责任。用户对服务的使用是根据所有适用于本站的国家法律、地方法律和国际法律标准的。用户必须遵循: 1. 使用网络服务不作非法用途。 2. 不干扰或混乱网络服务。 3. 遵守所有使用网络服务的网络协议、规定、程序和惯例。 用户须承诺不传输任何非法的、骚扰性的、中伤他人的、辱骂性的、恐性的、伤害性的、庸俗的，淫秽等信息资料。另外，用户也不能传输何教唆他人构成犯罪行为的资料；不能传输助长国内不利条件和涉及国家安全的资料；不能传输任何不符合当地法规、国家法律和国际法律的资料。未经许可而非法进入其它电脑系统是禁止的。 若用户的行为不符合以上提到的服务条款，本站将作出独立判断立即取消用户服务帐号。用户需对自己在网上的行为承担法律责任。用户若在本站上散布和传播反动、色情或其它违反国家法律的信息，本站的系统记录有可能作为用户违反法律的证据。

                        </p>
                        <h4>
                            十二、通告
                        </h4>
                        <p>
                            所有发给用户的通告都可通过重要页面的公告或电子邮件或常规的信件传送。服务条款的修改、服务变更、或其它重要事件的通告都会以此形式进行。
                        </p>
                        <h4>
                            十三、信息内容的所有权
                        </h4>
                        <p>
                            本网站定义的信息内容包括: 文字、软件、声音、相片、录象、图表；在广告中全部内容；本网站为用户提供的其它信息。所有这些内容受版权、商标、标签和其它财产所有权法律的保护。所以，用户只能在本网站和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。本站所有的文章版权归原文作者和本站共同所有，任何人需要转载本站的文章，必须征得原文作者或本站授权。
                        </p>
                        <h4>
                            十四、法律

                        </h4>
                        <p>
                            本协议的订立、执行和解释及争议的解决均应适用中华人民共和国的法律。用户和本网站一致同意服从本网站所在地有管辖权的法院管辖。如发生本网站服务条款与中华人民共和国法律相抵触时，则这些条款将完全按法律规定重新解释，而其它条款则依旧保持对用户的约束力。

                        </p>

                    </div>

                </el-tab-pane>
                <el-tab-pane label="购物流程" name="2-1">

                    <h4>1、搜索商品</h4>
                    本商城为您提供了方便快捷的商品搜索功能：<br>
                    （1）您可以通过在首页输入关键字的方法来搜索您想要购买的商品<br>
                    （2）您还可以通过本商城的分类导航栏来找到您想要购买的商品分类，根据分类找到您的商品<br>
                    <h4>2、放入购物车</h4>
                    在您想要购买的商品的详情页点击“加入购物车”，商品会添加到您的购物车中；您还可以继续挑选商品放入购物车，一起结算。<br>
                    （1）在购物车中，系统默认每件商品的订购数量为一件，如果您想购买多件商品，可修改购买数量<br>
                    （2）在购物车中，您可以将商品移至“收藏夹”，或是选择删除<br>
                    （3）在购物车中，您可以直接查看到商品的配送费用，免运费折扣等。<br>
                    （6）确认信息后请点击“结算”。<br>
                    温馨提示：<br>
                    （1）商品价格会不定期调整，最终价格以您提交订单后订单中的价格为准<br>
                    （2）优惠政策、配送时间、运费收取标准等都有可能进行调整，最终成交信息以您提交订单时网站公布的最新信息为准。<br>
                    <h4>3、登陆注册</h4>
                    （1）老顾客：请在“登录”页面输入Email地址或昵称、注册密码进行登陆<br>
                    （2）新顾客：请在“注册”页面按照提示完成注册<br>
                    <h4>4、核对订单信息</h4>
                    登陆后填写“填写核对订单信息”。<br>
                    （1）请填写并保存正确完整的收货人姓名、收货人联系方式、详细的收货地址和邮编等信息，否则将会影响您订单的处理或配送。<br>
                    （2）您可以进入“个人中心-配送地址”编辑常用收货地址，保存成功后，再订购时，可以直接选择使用。<br>
                    （3）确认无误后可点击“提交订单”。系统生成一个订单号，就说明您已经成功提交订单。<br>
                    <h4>5、确认支付</h4>
                    选择支付方式。本商城提供多种支付方式<br>
                    <h4>6、完成订单</h4>
                    订单提交成功后，您可以登陆“我的订单” 查看订单信息。<br>
                </el-tab-pane>
                <el-tab-pane label="联系我们" name="3-1">
                    联系电话：18521055532<br>
                    E-mail：pabpkp@163.com<br>
                    经营地址：重庆市江北区华新村96号5幢16-4<br>

                </el-tab-pane>
                <el-tab-pane label="常见问题" name="3-2">
                    Q：密码设置的技巧？<br>
                    A：为了您的帐户安全，建议您在设置密码时，请参考以下建议：<br>
                    密码最好是由6~10位字符组成（请使用数字+字母或符号的组合，字母区分大小写）否则安全系数较低。<br>
                    Q：为什么在登录过程中，系统总是提示“密码错误”或者“用户名不存在”等问题？<br>
                    A：您好！出现此类情况，大部分情况是因为：<br>
                    1、您输入的邮箱地址或昵称有误；若您曾修改过邮箱地址或是昵称，请用修改后的信息登陆<br>
                    2、您输入的密码有误；若您曾修改过注册密码，请用修改后的密码登录；如忘记密码，请点击“忘记密码”<br>
                    3、若您未在本商城成功注册，请点击“注册”，注册成功后，即可正常登陆。<br>
                    限时限量抢购常见问题<br>
                    Q：什么是抢购？<br>
                    A：您好，抢购是本商城最新推出的一种回馈新老订户的特惠活动，每天提供2～3种单品进行限时促销，涉及报刊、礼品、图书、电影票及蜘蛛卡等，让您享受无敌折扣。<br>
                    本商场抢购活动分三种类型：<br>
                    1）限时抢购：用户可在活动规定时段内进行商品抢购，付款完成即表示抢购成功；<br>
                    2）限量抢购：活动开始后，用户可在商品全部抢完前进行抢购，付款完成即表示抢购成功；<br>
                    3）限时限量抢购：此类抢购活动设定了抢购时间及抢购数量，用户可在规定时段内，商品未全部抢完前进行抢购，付款完成即表示抢购成功。<br>
                    Q：抢购用什么方式支付？<br>
                    A：您好，您可通过银联在线等支付方式支付您的抢购订单。<br>

                </el-tab-pane>
                <el-tab-pane label="快递送货" name="4-1">
                    <h4>1、配送方式</h4>
                    <p>
                        您在本商城上所订购的报刊，我们会根据您所选择的配送方式，由商家直接送货至您所指定的送货地点，但也有部分货物的配送由本平台直接负责。您可以根据所需收到宝贝的迫切程度来选择配送方式，但也需要承担相应的配送费用。
                    </p>
                    <h4>
                        2、减运费政策及运费说明
                    </h4>
                    <p>
                        您在本商城订购的宝贝图片中带有减运费字样时，可享受一定的减运费政策。
                    </p>

                </el-tab-pane>
                <el-tab-pane label="退换货流程" name="5-1">
                    售后服务-退换货流程<br>
                    请与客服中心联系办理退/换货申请；<br>
                    售后服务人员将在接到您的退/换货申请后进行审核，审核通过后通知您将退/换货商品及发票原件一并快递至指定地址；<br>
                    关于退换/货商品回寄：<br>
                    A）请通过普通快递将退换/货商品寄回，并由您自行承担寄运费；<br>
                    B）收到商品后，将会检查退货商品，并与供应商协调后进行退款或换货处理。<br>
                    C）换货商品将免费为您配送一次，如果二次还需要换货，来回寄运费均需要您自行承担。<br>
                    退货处理周期：7个工作日内（自收到商品之日起计算），换货处理周期：10日之内（自收到商品之日起计算）；<br>
                    一张订单，只为您提供一次退/换货服务，为确保您的权益，请考虑周全后申请办理。<br>
                    在商品退货时，需扣除购买该商品时所获得的积分及相应优惠，如账户积分已使用，则从商品退款金额中相应扣除。<br>
                </el-tab-pane>
                <el-tab-pane label="开具发票" name="5-2">
                    1. 您可在订单确认页面填写发票索要信息，包括：发票抬头、发票内容。一般情况，发票会随商品一起送达；<br>
                    2. 一个订单只能开具一张发票；<br>
                    3. 配送费金额包含在订单发票金额中，金额计算请参考配送须知。<br>
                    发票抬头<br>
                    发票抬头内容不能为空，请填写个人或公司名称，字数限制在15个字内。<br>
                    发票内容<br>
                    数码电子、服饰、图书、办公用品、食品、礼品、日用品。<br>
                    注：开票内容根据实际销售商品开具<br>
                    注意事项<br>
                    1. 发票金额不能高于订单金额。一个订单对应一张发票，不支持多个订单合开一张发票。<br>
                    2. 如果您购买的商品需要售后维修，为了保证您的售后服务权益（售后服务需根据发票确认您的购买日期），本商城将在发票上默认打印商品全称，且不支持修改发票内容。<br>

                </el-tab-pane>
                <el-tab-pane label="品质保障" name="5-3">
                    <h4>
                        1、服务支持
                    </h4>
                    您在购物过程中遇到任何问题，都可以联系客服寻求帮助。<br>
                    客服时间：工作日08:00-20:30   节假日09:00-18:00<br>
                    <h4>
                        2、安全保障
                    </h4>
                    本商城承诺自您签收商品之日起7日内可以申请退货,如符合本商城退货条件，我们将提供全款退货服务。<br>
                    本商城承诺自您签收商品之日起15日内可以申请换货，如符合本商城换货条件，我们将提供换货服务。<br>
                    <h4>
                        3、正品承诺
                    </h4>
                    本商城坚持“诚信为本”的经营理念，我们保证所售商品均为正品，如果您认为购买的商品是假货，并能提供国家相关质检机构的证明文件，我们会按照国家法律规定予以处理。<br>
                </el-tab-pane>
                <el-tab-pane label="公司介绍" name="6-1">
                    重庆未之峰商贸有限公司<br>
                    经营范围：汽车及零配件批发,汽车新车零售,灯具零售,日用百货批发,金属材料批发,建筑材料批发,润滑油零售,五金产品批发,劳保用品批发(除依法须经批准的项目外,凭营业执照依法自主开展经营活动)<br>
                    联系电话：18521055532<br>
                    E-mail：pabpkp@163.com<br>
                    经营地址：重庆市江北区华新村96号5幢16-4<br>
                </el-tab-pane>
            </el-tabs>
        </el-dialog>
    </div>
</template>
<script>
    import logo from '@/assets/image/layout/logo.png'
    import footContact from '@/assets/image/layout/foot-contact.png'
    export default {
        name: 'LayoutFooter',
        data(){
            return{
                logo: logo,
                footContact: footContact,
                dialogVisible: false,
                activeTab: '1-1',
            }
        },
        methods:{
            showTabContent(tab){
                this.activeTab= tab
                this.dialogVisible= true
            },
        }
    }
</script>
<style scoped>
    #footer{
        /*position:fixed;*/
        bottom:0px;
        width:100%;
        background:white;
    }
    .footer-container{
        width:1200px;
        margin:auto;
    }
    .footer-image{
        height:398px;
        background-image: url("~@/assets/image/layout/foot-contact.png");
        background-position: bottom;
        min-width: 1200px;
    }
    #service-icon ul{
        display: flex;
    }
    #service-icon ul li{
        list-style: none;
        flex: 1;
    }
    #service-icon::after,#bottom-links::after{
        border: 1px solid #DEDBDC;
        content:'';
        display:flex;
    }

    .links-cat{
        display: flex;
    }
    .links-cat li{
        flex:1;
        list-style: none;
        text-align: left;
    }
    .links-cat-title{
        margin-bottom:14px;
        font-size: 20px;
        font-weight: bold;
    }
    .links-list{
        text-align:left;
        padding: 0px;
        font-size:14px;
    }
    .links-cat::after{

    }
    .contact-group{
        display:inline-block;
    }
    #website-registration{
        background-color: black;
        margin:auto;
        width:100%;
    }
    .registration-wrapper{
        width:1200px;
        padding:30px 0;
    }
    .registration-wrapper{
        margin:auto;
        color:white;
    }
    .footer-tab-pane{
        text-align: left;
    }
    .unit-tab-pane{
        height: 500px;
        overflow-y:scroll;
    }
    .el-tab-pane{
        height:500px;
        overflow-y: auto;
    }

</style>
